{"blog": [], "keywords": [{"value": "HIS BROTHER, BRUCE RATNER", "name": "persons"}, {"value": "AND HIS SISTER, ELLEN RATNER. 1", "name": "persons"}, {"value": "HIS CHILDREN, JAKE AND ANA", "name": "persons"}, {"value": "RATNER, MICHAEL COLUMBIA LAW SCHOOL IS DEEPLY SADDENED BY THE LOSS OF OUR DISTINGUISHED ALUMNUS MICHAEL RATNER, A PIONEERING CIVIL LIBERTIES ATTORNEY AND PASSIONATE ADVOCATE FOR HUMAN RIGHTS AROUND THE WORLD. MICHAEL WAS AN INFLUENTIAL MENTOR AND COLLEAGUE TO MANY MEMBERS OF OUR COMMUNITY FOR DECADES. HE WILL BE MISSED, BUT HIS LEGACY WILL LIVE ON FOR GENERATIONS. WE EXTEND OUR CONDOLENCES TO HIS WIFE, KAREN RANUCCI", "name": "persons"}], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9801E7DE133AF937A25756C0A9609D8B63", "document_type": "article", "byline": null, "type_of_material": "Paid Death Notice", "multimedia": [], "section_name": "Paid Death Notices", "word_count": "81", "source": "The New York Times", "subsection_name": null, "lead_paragraph": "RATNER--Michael Columbia Law School is deeply saddened by the loss of our distinguished alumnus Michael Ratner, a pioneering civil liberties attorney and passionate advocate for human rights around the world. Michael was an influential mentor and colleague to many members of our community for decades. He will be missed, but his legacy will live on for generations. We extend our condolences to his wife, Karen Ranucci; his children, Jake and Ana; his brother, Bruce Ratner; and his sister, Ellen Ratner. 1", "pub_date": "2016-05-14T00:00:00Z", "news_desk": "Classified", "headline": {"main": "Paid Notice: Memorials  RATNER, MICHAEL COLUMBIA LAW SCHOOL IS DEEPLY SADDENED BY THE LOSS OF OUR DISTINGUISHED ALUMNUS MICHAEL RATNER, A PIONEERING CIVIL LIBERTIES ATTORNEY AND PASSIONATE ADVOCATE FOR HUMAN RIGHTS AROUND THE WORLD. MICHAEL WAS AN INFLUENTIAL MENTOR AND COLLEAGUE TO MANY MEMBERS OF OUR COMMUNITY FOR DECADES. HE WILL BE MISSED, BUT HIS LEGACY WILL LIVE ON FOR GENERATIONS. WE EXTEND OUR CONDOLENCES TO HIS WIFE, KAREN RANUCCI; HIS CHILDREN, JAKE AND ANA; HIS BROTHER, BRUCE RATNER; AND HIS SISTER, ELLEN RATNER. 1"}, "print_page": "08", "snippet": "RATNER--Michael Columbia Law School is deeply saddened by the loss of our distinguished alumnus Michael Ratner, a pioneering civil liberties attorney and passionate advocate for human rights around the world. Michael was an influential mentor and colleague to many members of our community for decades. He will be missed, but his legacy will live on for generations. We extend our condolences to his wife, Karen Ranucci; his children, Jake and Ana; his brother, Bruce Ratner; and his sister, Ellen Ratner. 1", "_id": "5741214f38f0d86cbc753b36", "slideshow_credits": null, "abstract": null}