{"blog": [], "keywords": [{"value": "VOUGHT, K. DEAN, OF GARDEN CITY, NY DIED JUNE 25. BELOVED HUSBAND OF THE LATE SUSAN E. VOUGHT AND AMAZING FATHER TO: LAURIE V. GALLAGHER, VICTORIA V. KING, MELINDA V. BEST, AMANDA V. ABRAHM, ALEXANDRA V. BOHN. HE WILL BE REMEMBERED AS A DEDICATED PROFESSIONAL WITH OVER 40 YEARS OF SERVICE AT KURT SALMON ASSOCIATES, A FERVENT PENN STATE ALUMNI AND AN ARDENT FAMILY MAN. HE WILL BE MISSED BY MANY, MOST PARTICULARLY HIS DAUGHTERS, SONS, IN, LAW, AND 11 GRANDCHILDREN! SERVICES WILL BE HELD AT GARDEN CITY COMMUNITY CHURCH AT 2PM, WEDNESDAY, JUNE 29. 1", "name": "persons"}], "web_url": "http://query.nytimes.com/gst/fullpage.html?res=9501E3DF113AF93BA15755C0A9609D8B63", "document_type": "article", "byline": null, "type_of_material": "Paid Death Notice", "multimedia": [], "section_name": "Paid Death Notices", "word_count": "93", "source": "The New York Times", "subsection_name": null, "lead_paragraph": "VOUGHT--K. Dean, of Garden City, NY died June 25. Beloved husband of the late Susan E. Vought and amazing father to: Laurie V. Gallagher, Victoria V. King, Melinda V. Best, Amanda V. Abrahm, Alexandra V. Bohn. He will be remembered as a dedicated professional with over 40 years of service at Kurt Salmon Associates, a fervent Penn State Alumni and an ardent family man. He will be missed by many, most particularly his daughters, sons-in-law, and 11 grandchildren! Services will be held at Garden City Community Church at 2pm, Wednesday, June 29. 1", "pub_date": "2016-06-28T00:00:00Z", "news_desk": "Classified", "headline": {"main": "Paid Notice: Memorials  VOUGHT, K. DEAN, OF GARDEN CITY, NY DIED JUNE 25. BELOVED HUSBAND OF THE LATE SUSAN E. VOUGHT AND AMAZING FATHER TO: LAURIE V. GALLAGHER, VICTORIA V. KING, MELINDA V. BEST, AMANDA V. ABRAHM, ALEXANDRA V. BOHN. HE WILL BE REMEMBERED AS A DEDICATED PROFESSIONAL WITH OVER 40 YEARS OF SERVICE AT KURT SALMON ASSOCIATES, A FERVENT PENN STATE ALUMNI AND AN ARDENT FAMILY MAN. HE WILL BE MISSED BY MANY, MOST PARTICULARLY HIS DAUGHTERS, SONS, IN, LAW, AND 11 GRANDCHILDREN! SERVICES WILL BE HELD AT GARDEN CITY COMMUNITY CHURCH AT 2PM, WEDNESDAY, JUNE 29. 1"}, "print_page": "16", "snippet": "VOUGHT--K. Dean, of Garden City, NY died June 25. Beloved husband of the late Susan E. Vought and amazing father to: Laurie V. Gallagher, Victoria V. King, Melinda V. Best, Amanda V. Abrahm, Alexandra V. Bohn. He will be remembered as a dedicated professional with over 40 years of service at Kurt Salmon Associates, a fervent Penn State Alumni and an ardent family man. He will be missed by many, most particularly his daughters, sons-in-law, and 11 grandchildren! Services will be held at Garden City Community Church at 2pm, Wednesday, June 29. 1", "_id": "577c74c238f0d849682ddc0c", "slideshow_credits": null, "abstract": null}