{"web_url": "http://query.nytimes.com/gst/fullpage.html?res=9F06E7D61E3FF937A25757C0A9659D8B63", "multimedia": [], "subsection_name": null, "print_page": "2", "blog": [], "source": "The New York Times", "section_name": "Real Estate", "abstract": null, "type_of_material": "News", "lead_paragraph": "An indulgent and elegant apartment on the 42nd floor of the Trump International Hotel and Tower, which was reconfigured to a two-bedroom, two-and-a-half-bath aerie from the original four bedrooms and six baths by the designer Jeffrey Bilhuber, sold for $16.25 million and was the most expensive sale of the week, according to city records.\n \nThe condominium, No. 42C at One Central Park West, had been listed last year at $19.9 million and sold after a reduction to $17.9 million; the monthly carrying charges are $12,531, and, as with most Trump properties, oodles of amenities are included with the privilege of ownership. The 4,415-square-foot residence, which has impressive views of Central Park, the Hudson River and the cityscape, sold for $5.04 million as a sponsor unit in 1997. After the owner enlisted Mr. Bilhuber to modernize and dramatize it, the property was featured in the May 2001 issue of Architectural Digest. Among other changes, he installed bamboo flooring in the foyer, created a private master suite with a limestone bath and separate dressing room, and designed an equally impressive guest suite with an elevated Japanese soaking tub made from black soapstone.", "keywords": [], "pub_date": "2013-04-14T00:00:00Z", "byline": {"original": "By ROBIN FINN", "person": [{"role": "reported", "firstname": "Robin", "organization": "", "rank": 1, "lastname": "FINN"}]}, "_id": "5174a967cf28d02a61001fd0", "slideshow_credits": null, "word_count": "439", "news_desk": "Real Estate Desk", "headline": {"main": "A Reconfigured Aerie", "kicker": "CITY ROOM"}, "snippet": "An indulgent and elegant apartment on the 42nd floor of the Trump International Hotel and Tower, which was reconfigured to a two-bedroom, two-and-a-half-bath aerie from the original four bedrooms and six baths by the designer Jeffrey Bilhuber, sol...", "document_type": "article"}