{"web_url": "http://query.nytimes.com/gst/fullpage.html?res=9A01EFDC113AF936A35756C0A9659D8B63", "multimedia": [], "subsection_name": null, "print_page": "24", "blog": [], "source": "The New York Times", "section_name": "Paid Death Notices", "abstract": null, "type_of_material": "Paid Death Notice", "lead_paragraph": "STEPHENSON--Conrad D. The governors, members and staff of The Real Estate Board of New York mourn the passing of Conrad D. Stephenson, who died on April 25. He was 85 years old. Connie served on REBNY's Board of Governors and was Vice President of the Institutional Owners Division from 1981-1991. Connie was born on May 14, 1927 in Brooklyn and was raised in St. Albans, Queens. Connie earned degrees from Fordham and NYU before joining Chase Manhattan Bank in 1950. He left for 17 years to do real estate lending on Long Island and thrived in his banking career, but his love of the military called and he re-enlisted in the Army Reserves, achieving the rank of Colonel before retiring in 1980. Connie played an active role in financing many real estate projects in New York thru senior management positions he held with several major financial institutions including Chase Manhattan Bank, The Bowery Savings Bank, and The First National Bank of Chicago. Connie was the CEO of Pan Am Equities from 1993-97 and was a director of Reckson Associates. Connie was instrumental in financing many of Glenwood Management's and H. J. Kalikow's residential developments and played a significant role in several commercial and mixed use projects including 101 Park Avenue, 9 West 57th Street, and Trump Tower. Connie was recognized as a philanthropic leader by his colleagues in the real estate industry when he received the prestigious Kenneth R. Gerrety Award in 1991. He was deeply involved in many prominent charities, most notably the National Jewish Center for Immunology and Respiratory Medicine. We express our sincere condolences to his wife Judi and the entire Stephenson family. Rob Speyer Chairman Steve Spinola- President", "keywords": [{"value": "STEPHENSON, CONRAD D", "name": "persons"}], "pub_date": "2013-05-05T00:00:00Z", "byline": null, "_id": "5190d91640e9ec457e2a0ce6", "slideshow_credits": null, "word_count": "282", "news_desk": "Classified", "headline": {"main": "Paid Notice: Deaths  STEPHENSON, CONRAD D"}, "snippet": "STEPHENSON--Conrad D. The governors, members and staff of The Real Estate Board of New York mourn the passing of Conrad D. Stephenson, who died on April 25. He was 85 years old. Connie served on REBNY's Board of Governors and was Vice President of...", "document_type": "article"}