{"web_url": "http://query.nytimes.com/gst/fullpage.html?res=9D02E0DD173AF937A25754C0A9659D8B63", "multimedia": [], "subsection_name": null, "print_page": "22", "blog": [], "source": "The New York Times", "section_name": "Paid Death Notices", "abstract": null, "type_of_material": "Paid Death Notice", "lead_paragraph": "McCOURT--David J. May 5, 1942 July 11, 2013. Born in New London, Connecticut, David McCourt, the second son of William J. McCourt and Elizabeth R. McCourt, passed away peacefully on July 11th at CT Hospice, with his devoted and loving wife, Mary Bryant McCourt at his side, after a long battle with metastatic melanoma. David leaves behind his wife Mary, two twin sons, Tavis and Stephen McCourt, two daughters, Elizabeth Smith and Kathy Paine, nine grandchildren and his sister, Mary McCourt Sheffield. David graduated from St. Francis Preparatory School in Biddeford, Maine in 1959, the University of Hartford in 1966, and Atlanta University in 1969 with a Masters in Business Administration. David was an avid baseball player in his youth playing throughout high school and college, and enlisted in the United States Marine Corps Reserves in 1963. In 1969 David joined the family business, ABCO Welding Supply, with his brother Bill and father William. David found a true passion in his sales role at ABCO and started a welding school during his tenure at ABCO. David moved to Old Saybrook, Connecticut in 1980, and enjoyed coaching Little League Baseball, skiing and running around north cove. In 1986, David and his brother Bill succeeded their father in running ABCO, and together with a group of talented and hard-working employees, grew the business consistently for 25 years before selling ABCO in 2011. In 1994, David married Ruth Clifford of Cork, Ireland, and moved to Newton, Massachussets. In 1997, David and Ruth were blessed with the birth of a daughter, Juliana Valentine. Ruth and Juliana died tragically as victims of the terrorist attacks of September 11, 2001 on the World Trade Center in New York. Following the events of September 11th, David, together with the Cuomo family helped found B.R.A.V.E. Juliana, a program of HELP USA, to teach non-violence and conflict resolution to children. David became a recognized voice to the world, appearing on TV with Diane Sawyer, Larry King, Connie Chung and many others. Deepak Choprah dedicated his book, The Deeper Wound, Recovering the Soul from Fear and Suffering, to Ruth, Paige and Juliana, and invited David to travel together speaking about the greater purpose and meaning of life. David met Mary Bryant in January 2002, through a friend to help through the difficult time and lead him to creating something positive. David and Mary founded the Juliana Valentine McCourt Children's Education Fund, and their friendship grew over the years to a deep, significant love. The two were married at St. Francis Chapel in Niantic, CT in 2011. David became a prominent supporter of the Achilles Freedom Team of Wounded Veterans, which Mary had founded through Achilles International, and the McCourt Memorial Garden at the Lyman Allen Museum. David enjoyed playing the game of golf (a game he always loved if never mastered) as a member at the Black Hall, Old Lyme Country Club and Lake of Isles Country Club in Connecticut and Trump International in Florida, where he retired and took residence. David will be missed sorely for his sense of humor, laughter, and love of life, economic and political discussions, sincere generosity, and his deep belief in mulligans. A memorial service will be held for family and friends at the Old Lyme Country Club in Connecticut on July 27th from 2-4pm, with a short service and opportunity to share memories at 3pm. For details, please contact: NeilanFuneralHome.com. Donations can be made in his honor to the McCourt Memorial Garden, or Achilles International.", "keywords": [{"value": "MCCOURT, DAVID J", "name": "persons"}], "pub_date": "2013-07-14T00:00:00Z", "byline": null, "_id": "51ed59a738f0d8431a75a620", "slideshow_credits": null, "word_count": "582", "news_desk": "Classified", "headline": {"main": "Paid Notice: Deaths  MCCOURT, DAVID J"}, "snippet": "McCOURT--David J. May 5, 1942 July 11, 2013. Born in New London, Connecticut, David McCourt, the second son of William J. McCourt and Elizabeth R. McCourt, passed away peacefully on July 11th at CT Hospice, with his devoted and loving wife, Mary B...", "document_type": "article"}