{"web_url": "http://www.legacy.com/Link.asp?I=LS000171995047", "multimedia": [], "subsection_name": null, "print_page": null, "blog": [], "source": "The New York Times", "section_name": "Paid Death Notices", "abstract": null, "type_of_material": "Paid Death Notice", "lead_paragraph": "<!-- FRANCES  PHELAN -->PHELAN--Frances (Frank) Wallace, businessman and philanthropist, 88, passed away Monday, August 4th, 2014. He died in the comfort of his home in Melville, New York, surrounded by his family. Born in Brooklyn, New York, on June 15, 1926, he was the loving son of Frances Phelan and Florence Wallace and was married to Mary (Ahern) Phelan for 68 years. He is survived by his wife; three children, Mark (and Maryellen) Phelan of Chappaqua, Deborah Phelan of Sausalito, California, and Frank Phelan of Point Lookout; six grandchildren; and two great-grandchildren. He was predeceased by one grandchild. In a career which spanned over sixty years, Mr. Phelan's business endeavors included serving as the Vice-President and Owner of The DIC Concrete Corporation, which completed construction on many New York City landmarks including 101 Park Avenue, the original 1 World Trade Center, the Pan Am building, Lefrak City, Albany Office Tower, and Trump Towers. Since 1970, through a DIC Concrete subsidiary, DIC Underhill JV, he completed construction of Co-op and Starrett Cities, and many other major buildings. He was a leading developer of both low income and luxury housing, including Liberty Court, Liberty House, and Liberty Terrace in Battery Park City. He was one of the principle owners of BSR Management Corp., Capital Airlines Inc., and Certified Industries Inc. In 1975, prior to the Iranian Revolution, Mr. Phelan oversaw and completed the construction of Farahzad and Ekbatan, the largest mass housing complex in western Tehran. His legacy as a great businessman can be seen not only through his tangible accomplishments, but also through the many people for whom he was a mentor and a source of inspiration. One colleague of over forty years recently described him as a \"gentle, gentle, gentleman.\" His charitable work is channeled through the Phelan Foundation, which supports causes such as Building Homes for Hero's, an organization providing veterans housing; and the humanitarian work of agencies such as Doctors without Borders, The Sisters of the Poor, and St. Jude's Hospital. He also generously donated to the Catholic Church. Funeral services will be held on Wednesday, August 6th, 2014, at the Vernon C. Wagner Funeral Home in Plainview, New York between 5-9pm. The Funeral mass follows on Thursday, August 7th, 2014, at Plainview's St. Pius X Roman Catholic Church at 11am. Mr. Phelan will be buried at St. Charles Cemetery in Farmingdale, New York. In lieu of flowers, the family requests that contributions be made to the Phelan Foundation.<br><br>\n ", "keywords": [], "pub_date": "2014-08-06T02:34:06Z", "byline": null, "_id": "53e1ee9838f0d81effd09d66", "slideshow_credits": null, "word_count": "408", "news_desk": "Classified", "headline": {"main": "Paid Notice: Deaths  PHELAN, FRANCES "}, "snippet": "PHELAN--Frances (Frank) Wallace, businessman and philanthropist, 88, passed away Monday, August 4th, 2014. He died in the comfort of his home in Melville, New York, surrounded by his family. Born in Brooklyn, New York, on June 15, 1926, he was the...", "document_type": "article"}